app/controllers/admin/categories_controller.rb

	def index
		@categories = Category.all
		@users = User.all
---
SELECT "categories".* FROM "categories"
SELECT "users".* FROM "users"

	def create
		@category = Category.new(category_params)
		@category.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "dwed"], ["created_at", 2017-04-01 10:01:41 UTC], ["updated_at", 2017-04-01 10:01:41 UTC]]

	def update
		@category = Category.find(params[:id])
		@category.update(category_params)
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "categories" SET "name" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["name", "13"], ["updated_at", 2017-04-01 10:06:11 UTC], ["id", 1]]