app/views/topics/index.html.erb

<%= form_tag topics_path, method: :get do %>
	<%= select_tag "categories", options_from_collection_for_select( Category.all, :id, :name),:onchange => 'this.form.submit()', prompt: "ALL" %>
---
SELECT "categories".* FROM "categories"