app/views/topics/latest.html.erb

SELECT COUNT(*) FROM "users"
SELECT COUNT(*) FROM "topics"
SELECT COUNT(*) FROM "comments"
---

<p>全站使用者人數<%= User.count %></p>

<p>全站總共有多少主題<%= Topic.count %></p>

<p>全站總共有多少回覆<%= Comment.count %></p>