app/views/topics/new.html.erb


	<%= f.collection_check_boxes(:category_ids, Category.all, :id, :name) %>
---
SELECT "categories".* FROM "categories" WHERE 1=0