app/views/topics/show.html.erb

SELECT "categories".* FROM "categories" INNER JOIN "topic_category_ships" ON "categories"."id" = "topic_category_ships"."category_id" WHERE "topic_category_ships"."topic_id" = ?  [["topic_id", 18]]
---

<% @topic.categorys.each do |category| %>