app/views/users/porfile.html.erb

SELECT "topics".* FROM "topics" WHERE "topics"."user_id" = ?  [["user_id", 1]]
---

<% current_user.topics.each do |topic| %>

SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = ?  [["user_id", 1]]
---

<% current_user.comments.each do |comment| %>