app/controllers/comments_controller.rb

	def create
		@comment = current_user.comments.new(comment_params)
		@comment.topic_id = params[:topic_id]
		@comment.save
---
INSERT INTO "comments" ("content", "user_id", "topic_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "111"], ["user_id", 4], ["topic_id", 4], ["created_at", 2017-03-24 14:35:05 UTC], ["updated_at", 2017-03-24 14:35:05 UTC]]