app/controllers/topics_controller.rb

	def index
		if params[:categories].present? # params[:categories] != '' present == not_blank
			@category = Category.find(params[:categories])
			@topics = @category.topics.order('comments_count desc',).page(params[:page]).per(5)
---
SELECT "categories".* FROM "categories"
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "topics".* FROM "topics" INNER JOIN "topic_category_ships" ON "topics"."id" = "topic_category_ships"."topic_id" WHERE "topic_category_ships"."category_id" = ? ORDER BY comments_count desc LIMIT ? OFFSET ?  [["category_id", 4], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "topics" INNER JOIN "topic_category_ships" ON "topics"."id" = "topic_category_ships"."topic_id" WHERE "topic_category_ships"."category_id" = ?  [["category_id", 4]]

	def latest
  	@users = User.count(params[:id])
  	@topics = Topic.count(params[:id])
  	@comments = Comment.count(params[:id])
---
SELECT COUNT(*) FROM "users"
SELECT COUNT(*) FROM "topics"
SELECT COUNT(*) FROM "comments"

	def create
		# 使用者可以 create 一篇文章
		# byebug
		@topic = current_user.topics.new(topic_params)
		if @topic.save
---
INSERT INTO "topics" ("title", "description", "file_location", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "xswd,xl;w"], ["description", ",wedlew[dle2p[d"], ["file_location", ""], ["created_at", 2017-03-30 02:14:38 UTC], ["updated_at", 2017-03-30 02:14:38 UTC], ["user_id", 5]]

	def show
		# @topic = Topic.find(params[:id])
		@comments = @topic.comments.order('created_at desc')

    @impression = @topic.impression
    @impression = @impression +1
    @topic.update(:impression => @impression)
---
SELECT "comments".* FROM "comments" WHERE "comments"."topic_id" = ? ORDER BY created_at desc  [["topic_id", 4]]
UPDATE "topics" SET "impression" = ?, "updated_at" = ? WHERE "topics"."id" = ?  [["impression", 1], ["updated_at", 2017-04-01 06:16:19 UTC], ["id", 17]]

	def update
		# 使用者可以 update 一篇文章
		# @topic = Topic.find(params[:id])
		if @topic.update(topic_params)
---
UPDATE "topics" SET "description" = ?, "updated_at" = ? WHERE "topics"."id" = ?  [["description", "return on"], ["updated_at", 2017-03-27 07:58:45 UTC], ["id", 18]]

	def destroy
		# 使用者可以 destroy 一篇文章
		# @topic = Topic.find(params[:id])
		@topic.destroy
---
DELETE FROM "topics" WHERE "topics"."id" = ?  [["id", 15]]