app/controllers/users_controller.rb

	def update
		if current_user.update(user_params)
---
UPDATE "users" SET "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "22222@gmail.com"], ["updated_at", 2017-04-02 06:05:31 UTC], ["id", 7]]